1. Given a sample list, tuple and a set with elements as numbers from 1-10. Convert each
   of the data types into a pandas series. Create a separate list of index values for the
   series.

In [15]:
import pandas as pd
import numpy as np
lst = [*range(1, 11)]
tp = (range(1, 11))
st = {range(1, 11)}
_index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
s1 = pd.Series(lst, index=_index)
s2 = pd.Series(tp, index=_index)
# s3 = pd.Series(st, index=['a','b','c','d','e','f']) -> will throw error as SET is unordered and cannot be indexed.
print(s1, s2)

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64 a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

2. Create a python dictionary with three key value pairs. Keep the keys as the first names,
   and the respective last names as values in the dictionary. Use the dictionary to create a
   pandas series.

In [16]:
my_dict = {'Anmol': 'Ratan', 'James': 'Cameroon', 'Arnold': 'Schwarzenger'}
s4 = pd.Series(my_dict)
s4

Anmol            Ratan
James         Cameroon
Arnold    Schwarzenger
dtype: object

```
3. Create a pandas series, with the elements as numbers from 1-10. Use the index values
starting from 0-10. For the above series:
a. Convert it to a list.
b. Convert it to a dictionary.
c. Convert it to a tuple.
d. Convert it to a set.
```

In [26]:
s5 = pd.Series(np.arange(1, 11))
# ls=s5.tolist()
ls = list(s5)
# dt=s5.to_dict()
dt = dict(s5)
# tp=(list(s5.items()))
tp = tuple(s5)
# st={*list(s5.items())}
st = set(s5)
print(ls, dt, tp, st)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10] {0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8, 8: 9, 9: 10} (1, 2, 3, 4, 5, 6, 7, 8, 9, 10) {1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

```
4. Create a sample pandas series with x integer elements. Perform the following operations
on the same:
a. Print the first 5 elements of the series
b. Print the last 5 elements of the series
c. Insert an integer value ‘50’ at the index 5.
d. Update the last element in the series with the value 100.
e. Delete the first element from the series.
Note: The index values must not be affected by the operations and should be uniform for
the series after the last operation.
```

In [55]:
s6 = pd.Series(np.random.randint(0, 100, 10))
print(s6)
# a = s6.iloc[0:5]
a = s6.head()  # default first 5 elements
# b = s6.iloc[-5:]
b = s6.tail()  # default last 5 elements
s6.iloc[5] = 50
s6.iloc[-1] = 100
s6.drop(0, inplace=True)  # inplace - permanent change
# drop - avoid creating duplicate indexing
s6.reset_index(drop=True, inplace=True)
s6

0    78
1    10
2    83
3    31
4    49
5    65
6    33
7    12
8    41
9    97
dtype: int32

0     10
1     83
2     31
3     49
4     50
5     33
6     12
7     41
8    100
dtype: int32

5. For a given pandas series obtained in the 4th step. Write a sample code to find the
   element 100 in the series.

In [63]:
# x=lambda s,n:f'{n} is present at {list(s).index(n)}' if n in list(s) else f'Not found.'
s6[s6 == 100].index[0]

8

```
6. For the given series A and B, perform concatenation on the same.
series_A = pd.Series([1,2,3,4,5])
series_B = pd.Series([6,7,8,9,10])
```

In [66]:
series_A = pd.Series([1, 2, 3, 4, 5])
series_B = pd.Series([6, 7, 8, 9, 10])
new_ser = pd.concat([series_A, series_B], ignore_index=True)
new_ser

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

7. Using loops in python, print all the elements within a pandas series.
   Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])

In [69]:
Sample = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
for i in Sample:
    print(i)

1
2
3
4
5
6
7
8
9
10

```
8. For a given nested list and a sample dictionary, create two data frames using pandas.
List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]
Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}
```

In [123]:
List = [['AA', 'BB', 'CC'], ['DD', 'EE', 'FF'], ['GG', 'HH', 'II']]
Dictionary = {'Kris': ['Jordan', 12, 22], 'Memphis': ['Depay', 23, 24]}

In [124]:
df1 = pd.DataFrame(List)
df1

    0   1   2
0  AA  BB  CC
1  DD  EE  FF
2  GG  HH  II

In [125]:
pd.DataFrame(Dictionary)

     Kris Memphis
0  Jordan   Depay
1      12      23
2      22      24

```
9. Create a pandas Dataframe with two columns = [‘Name’, ‘Age’]. Perform the following
operations on the same.
a. Print the first 3 rows of the Data Frame .
b. Print the rows that have the age greater than 15.
c. Insert 5 imaginary names and ages as values to the pandas Data Frame .
d. Update the 5th row so that the name = john and age=56.
e. Delete the first row from the Data Frame .
```

In [126]:
# Create a list of lists to represent the data in the DataFrame
data = [['John Doe', 30], ['Jane Doe', 14], ['Peter Smith', 40]]

# Create the DataFrame and specify the column names
df = pd.DataFrame(data, columns=['Name', 'Age'])

In [127]:
df.head(3)

          Name  Age
0     John Doe   30
1     Jane Doe   14
2  Peter Smith   40

In [128]:
df[df['Age'] > 15]

          Name  Age
0     John Doe   30
2  Peter Smith   40

In [167]:
df1 = pd.DataFrame([['James Golgappe', 25], ['Arnold Shezwan', 76], [
                   'Larry Panwala', 52], ['Harry Potter', 20]], columns=['Name', 'Age'])
df2 = pd.concat([df, df1]).reset_index(drop=True)
df2

             Name  Age
0        John Doe   30
1        Jane Doe   14
2     Peter Smith   40
3  James Golgappe   25
4  Arnold Shezwan   76
5   Larry Panwala   52
6    Harry Potter   20

In [168]:
df2.at[5, 'Name'] = 'James'
df2.at[5, 'Age'] = 56
df2

             Name  Age
0        John Doe   30
1        Jane Doe   14
2     Peter Smith   40
3  James Golgappe   25
4  Arnold Shezwan   76
5           James   56
6    Harry Potter   20

In [169]:
df2.drop(0, inplace=True)
df2.reset_index(drop=True, inplace=True)
df2

             Name  Age
0        Jane Doe   14
1     Peter Smith   40
2  James Golgappe   25
3  Arnold Shezwan   76
4           James   56
5    Harry Potter   20

10. For the Data Frame obtained from step 9, convert the same to a list and a dictionary
    respectively.

In [170]:
df2.to_dict('list')

{'Name': ['Jane Doe',
  'Peter Smith',
  'James Golgappe',
  'Arnold Shezwan',
  'James',
  'Harry Potter'],
 'Age': [14, 40, 25, 76, 56, 20]}

In [171]:
df2.values.tolist()

[['Jane Doe', 14],
 ['Peter Smith', 40],
 ['James Golgappe', 25],
 ['Arnold Shezwan', 76],
 ['James', 56],
 ['Harry Potter', 20]]

```
11. Create two separate Data Frame s A and B, and perform the following operations on
them.
a. Concatenate the two Data Frame s to a new Data Frame C.
b. Split the Data Frame C row wise.
c. Split the Data Frame column wise based on a condition. For example - columns
values greater than 10, column values less than 10, etc.
```

In [174]:
df1 = pd.DataFrame(range(1, 11), columns=['A'])

df2 = pd.DataFrame(range(11, 21), columns=['B'])

In [175]:
C = pd.concat([df1, df2])

In [176]:
C.reset_index(drop=True, inplace=True)

In [177]:
C = pd.concat([df1, df2], axis=1)

In [178]:
C.iloc[0:5, :]   # C[start_row:end_row, start_col: end_col]

   A   B
0  1  11
1  2  12
2  3  13
3  4  14
4  5  15

In [179]:
C[C['A'] > 5]

    A   B
5   6  16
6   7  17
7   8  18
8   9  19
9  10  20

```
12. Create a Data Frame with columns Name and Age. Perform the following operations.
a. Write a sample code to search for the Name/Names where Age is 20.
b. Sort the Data Frame in ascending order of ages.
c. Using Python loops, print the ages from the data frame and store it in a set
```

In [180]:
d = {'Name': ['Virat', 'Sachin', 'Viru', 'Rohit'], 'Age': [20, 40, 32, 15]}
df = pd.DataFrame(d)

In [181]:
# a

df[df['Age'] == 20]

    Name  Age
0  Virat   20

In [182]:
# b

df.sort_values(by='Age')

     Name  Age
3   Rohit   15
0   Virat   20
2    Viru   32
1  Sachin   40

In [184]:
l = []

for i in range(len(df)):
    l.append(df.iloc[i][1])

s = set(l)
s

{15, 20, 32, 40}